Tekla Open API Reference for Tekla Structures 2025
Material Methods
The PourObjectFilterExpressions.Material type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
PourObjectFilterExpressions.Material Class
Tekla.Structures.Filtering.Categories Namespace